{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Computer Engineering",
      "duration": "2018-2023",
      "school_name": "Toronto Metropolitan University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SrivatsanViswanathan",
  "highlighted_projects": [
    {
      "description": "Designed and built an autonomous robot capable of navigating and collecting ping pong balls. Led the training of the robot to recognize and avoid obstacles, achieving a consistent confidence value of over 80%. Utilized PyTorch and Python to train an SSD MobileNet object detection model on a custom-labeled dataset, ensuring precise and reliable object detection.",
      "git_url": null,
      "name": "Autonomous Ping Pong Collector"
    },
    {
      "description": "Created an ecommerce store enabling users to log in, browse, and purchase hockey equipment. Developed the front end using React, with state management handled by Redux for a maintainable codebase. Stored and managed product data on Airtable, and used Netlify Serverless Functions with Node to securely access API keys.",
      "git_url": "https://github.com/SrivatsanViswanathan/react-hockey-store",
      "name": "Sri's Pucks"
    },
    {
      "description": "Developed a bookstore application in Java, allowing clients to browse and purchase books while enabling owners to manage inventory. Implemented a loyalty program with classes that reward points for book purchases, enhancing customer engagement and retention.",
      "git_url": "https://github.com/SrivatsanViswanathan/bookstore",
      "name": "Bookstore"
    },
    {
      "description": "Developed a web application for job application management, allowing users to register, log in, and manage their job applications. Users can add, update, and delete job entries, and track the status of their applications. Built the front end with React, the back end with Node and Express.js, and used MongoDB for storing user credentials and job details.",
      "git_url": "https://github.com/SrivatsanViswanathan/job-tracker",
      "name": "Job Tracker"
    }
  ],
  "jarvis_projects": [
    {
      "description": [
        "Developed a Linux Cluster Monitoring App to record hardware specifications and monitor resource usages for each node in real time to help the Jarvis Linux Cluster Administration (LCA) team manage their Linux cluster environment.",
        "The product is built using Linux bash scripts to collect the data, PostgreSQL to store the data, docker for hosting the database, and Git for version control.",
        "Cron jobs were used to log hardware usage every minute and persist it into the database."
      ],
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Developed an Insurance API that allows you to manage and retrieve information related to customers vehicle insurance for support and business decisions. For example, seeing the amount of insured drivers in a city and their data.",
        "The product is built using Java Spring Boot to create the API endpoints, MongoDB to store the data, Maven for dependencies, Swagger for API documentation, and Git for version control."
      ],
      "git_url": "/insurance-mongo",
      "name": "Insurance API"
    },
    {
      "description": [
        "Created three dashboards to help visualize key metrics and trends.",
        "Beverages Dashboard analyzes the performance of various beverages in the United States, including units sold, average price, total sales, sales by state, and profit analysis to help stakeholders make informed business decisions.",
        "Data Professionals Survey Dashboard breaks down survey responses from data professionals highlighting job roles, satisfaction levels, career challenges, and preferred programming languages helping current professionals and aspiring students to gain an understanding of the current state of the industry.",
        "Stocks Dashboard visualizes key stock statistics like price metrics, market cap, dividend yield, and historical trends allowing investors and analysts to track stock performance."
      ],
      "git_url": "/power_bi",
      "name": "Power BI Dashboards"
    }
  ],
  "name": "Srivatsan Viswanathan",
  "others": [
    {
      "bullets": [
        "Volunteer: I volunteer at Parkrun on Saturdays at 9am to help run a 5km run. I've helped with various different tasks like scanning barcodes, recording times, photography, and helping the runners stay on course as a marshal.",
        "Running: I am training to run a 5k. I go on runs in the morning and am planning on running in Parkrun eventually.",
        "Hockey fan: GO LEAFS GO! I'm a big Leafs fan. I am hoping they are able to win a cup in my lifetime as they have not won since 1967..."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed software applications for Jarvis using technologies like Java, Spring, PostgreSQL, MongoDB, Docker, Bash, PowerBI, and Git. Worked collaboratively with a team of developers in an Agile environment. Implemented automation scripts, optimized PostgreSQL databases, and containerized applications with Docker for efficient deployment. Ensured code quality through peer reviews and continuous integration contributing to a culture of continuous improvement and high performance.",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Sweatcoin",
      "description": "Designed and created a web application that allows users to track their winnings for prize draws they have entered in. Utilized React for the front end, MongoDB to store the winners, and Node and Express.js for the backend. Created a script to persist all the winners from an excel file to MongoDB. Optimized the search functionality by reducing the search time by 92% and reduced website resource by 66%.",
      "duration": "Jan 2024 - Apr 2024",
      "title": "Freelance"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Tailwind",
      "Docker",
      "Spring Boot",
      "Google Cloud Platform",
      "Power BI"
    ],
    "familiar": [
      "Matlab",
      "C",
      "VHDL",
      "LaTeX",
      "Vite"
    ],
    "proficient": [
      "Java",
      "JavaScript / TypeScript",
      "React",
      "NodeJs",
      "HTML \u0026 CSS",
      "Linux/Bash",
      "RDBMS/SQL (SQLite, PostgreSQL)",
      "NoSQL (MongoDB)",
      "Agile/Scrum",
      "Git",
      "RESTful API"
    ]
  },
  "summary": "Hi, my name is Srivatsan. I am a computer engineering graduate from Toronto Metropolitan University with a strong passion  for software development and DevOps practices. One of my favorite projects is Sweat Rewards, where I developed a website that  allows users to check their prize draw results and access support resources. I am now seeking a DevOps role where I can apply  my skills and experiences to contribute to impactful projects and make a positive difference.\n"
}
